Revit 2027 API
ParameterValue.IsEqual Method
 Tests equality with another instance of the same class.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	ParameterValue other
)
Public Function IsEqual (
	other As ParameterValue
) As Boolean
public:
bool IsEqual(
	ParameterValue^ other
)
member IsEqual :
        other : ParameterValue -> bool
Parameters
other ParameterValue
 The instance to compare with
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The result is always False if the two comparands are of a different value types.
See Also
Reference
ParameterValue Class
Autodesk.Revit.DB Namespace